app/controllers/recipes_controller.rb

	def index
    begin
      @recipe = Recipe.select(:id, :title, :making_time, :serves, :ingredients, :cost).all
---
SELECT "recipes"."id", "recipes"."title", "recipes"."making_time", "recipes"."serves", "recipes"."ingredients", "recipes"."cost" FROM "recipes"

  def create
  	begin
    	@recipe = Recipe.new(recipes_params)
    	if @recipe.valid?
    		@recipe.save
---
INSERT INTO "recipes" ("title", "making_time", "serves", "ingredients", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
  	begin
	  	if @recipe.present?
	  		@recipe.update(recipes_params)
---
UPDATE "recipes" SET "cost" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["cost", 900], ["updated_at", "2021-11-14 11:15:01.283958"], ["id", 1]]

  def destroy
  	begin
	  	if @recipe.present?
	  		@recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]

    def set_recipes
      @recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]